/***********************************************************************
* 
* 时    间：2008-10-9
*
* 文 件 名：CPUIint.c
*
* 版    本：AKD10P07(发布版)
*
* 作    者：北京爱科迪信息通讯技术有限公司—技术部—杨淳雯
* 
* 功能说明：MCU初始化，1，配置系统时钟，2，关看门狗，3配置GPIO
*
*           详细请参考C8051F020手册和KEIL C51编译器手册
*
***********************************************************************/
#include "c8051f120.h"
#include "cpu.h"
#include "station.h"


/*静态函数*/
static void WatchdogInit(void);
static void OSCInit(void);
static void PortInit(void);


/***********************************************************************
*
* 函数原型：void CPU020Init(void)
*
* 入口参数：无
*
* 出口参数：无
*
* 功能描述：CPU配置初始化
*
***********************************************************************/
void CPU020Init(void)
{	
	WatchdogInit();	//配置看门狗	
	OSCInit();		//配置系统时钟
	PortInit();		//配置端口
}


/***********************************************************************
*
* 函数原型：void WatchdogInit(void)
*
* 入口参数：无
*
* 出口参数：无
*
* 功能描述：禁止看门狗，不用看门狗
*
***********************************************************************/
static void WatchdogInit(void)
{
	EA 	  = 0;
	WDTCN = 0xde;
	WDTCN = 0xad;
	EA 	  = 1;
}


/***********************************************************************
*
* 函数原型：static void OSCInit(void)
*
* 入口参数：无
*
* 出口参数：无
*
* 功能描述：禁止内部时钟，让CPU工作在外部时钟，工作频率为22.1184MHz
*
***********************************************************************/
static void OSCInit(void)
{
	int i;
	
	i = 5000;
    SFRPAGE   = CONFIG_PAGE;
	SFRPGCN	 |= 0x01;
	OSCXCN    = 0x67;
    while(i--)
	{
		;
	} 
    while ((OSCXCN & 0x80) == 0);
   
    CLKSEL  =  0x01;    //sysclk源于外部振荡源，且没有分频
    OSCICN &= ~0x80;  	//禁止内部振荡器  
}


/***********************************************************************
*
* 函数原型：void PortInit(void)
*
* 入口参数：无
*
* 出口参数：无
*
* 功能描述：根据原理图有以下管脚，通过交叉开关进行配置
*
* 输出：	
* p0.0 ->  TXD0(TX0)
* p0.1 ->  RXD0(RX0);	串口0分别与GPS,倾斜仪，电子罗盘
* p0.2 ->  TXD1(RX1)		      
* p0.3 ->  RXD1(TX1);
*
* 剩下的引脚均为GPIO(通用的I/0口)
*
* (注意：配置时一定要遵守优先级，详情请看C8051F020.PDF文档)
*
***********************************************************************/
static void PortInit(void)
{
	SFRPAGE = CONFIG_PAGE;
	XBR0 	= 0x04;			//串口0配置到p0.0,p0.1
	XBR1 	= 0x00;			//INT0 INT1不配置到端口 
	XBR2 	= 0x44;			//使能数据交叉开关和弱上拉;串口1配置到p1口
	
	P0MDOUT = 0xff; 		//配置为推挽输出方式 
	P1MDOUT = 0xef; 		//配置为推挽输出方式(2009-3-4是否有无线切换)
	P2MDOUT = 0xff; 		//配置为推挽输出方式

	P3MDOUT = 0x00; 		//配置为漏极开路方式,检测开关
	P4MDOUT = 0x00;
    P5MDOUT = 0x00; 			  
	P6MDOUT = 0x00;		 
	P7MDOUT = 0x00;

	P2 		= 0x00;			//关电机

	LEDCLOSE;				//2009-3-4加入GPIO初始化
	LEDGREENCLOSE;
	LEDREDCLOSE;
}
